// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// const answer = prompt ("What is your name");

// const number = Number(prompt('Введіть число'));
// console.log(number);

// if (number === 10) {
//     alert('Вірно');
    
// } else {
//     alert('Невірно');
// }

// alert(number === 10 ? 'Вірно' : 'Невірно');



// Завдання 2:

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);
// console.log(min);

// if (min <= 15) {
//     alert(`${min} хвилин - перша чверть`);
// } else if (min <= 30) {
//     alert(`${min} хвилин - друга чверть`);
// } else if (min <= 45) {
//     alert(`${min} хвилин - третя чверть`);
// } else {
//     alert(`${min} хвилин - четверта чверть`);
// }



// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const number = prompt('Скільки?');
// switch (number) {
//     case '1':
//         alert('зима');
//         break;
//     case '2':
//         alert('весна');
//         break;
//     case '3':
//         alert('літо');
//         break;
//     case '4':
//         alert('осінь');
//         break;
//     default:
//         alert('Вибачте, але ви маєте ввести значення від 1 до 4 включно');

// }



// Завдання 8:

// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.


// function min(a, b) {
//     if (typeof a === "number" || typeof b === "number") {
//         return 'Not a number!'
//     } else if (a > b) {
//         return b;
//     } else {
//         return a;
//     }
// return Math.min(a, b);
// }

// console.log(min(2, '5'));

// Завдання 7:

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// function getNumbers(min, max) {
//     let count = 0;
//     for (let i = max; i >= min; i--) {
//         count = i--;
//         console.log(count);
//     }
    
// }

// getNumbers(5, 55);

// Завдання 10:

// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

// function fizzBuzz(num) {
//     switch(num) {
//         // case (num % 5 === 0 && num % 3 === 0);
//         //     return 'fizzbuzz';
//         //     break;
//         case (num % 5 === 0);
//             return 'buzz';
//             break;
//         case (num % 3 === 0);
//             return 'fizz';
//             break;
//         default
//             return
        
//     }
// }
// fizzBuzz(5);

// function fizzBuzz(num) {

// }




//! ------------------------DO TASKS BY MYSELF----------
// Завдання 1:

// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().


// const number = Number(prompt('write a number'));
// number === 10 ? alert('Вірно') : alert('Невірно');

//! ----------------------------------

// Завдання 2:

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// let min = Math.floor(Math.random() * 59);
// if (min > 45) {
//     alert(`${min} входить в четверту чверть`);
// } else if(min > 30) {
//     alert(`${min} входить в третю чверть`);
// } else if(min > 15) {
//     alert(`${min} входить в другу чверть`);
// } else {
//     alert(`${min} входить в першу чверть`);
// }

// console.log(min);


//! ----------------------------------

// Завдання 3:

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.



// let num = Number(prompt('write a number from 1 to 4'));
// let result;
// switch (num) {
//     case 1:
//         result = 'зима';
//         break;
// case 2:
//         result = 'весна';
//         break;
//     case 3:
//         result = 'літо';
//         break;
//     case 4:
//         result = 'осінь';
//         break;
//     default:
//         result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно"
//         break;
// }
// console.log(result);


//! ----------------------------------

// Завдання 4:

// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples


// let num = Number(prompt('Write minutes'));
// if (num < 61) {
//     console.log(`Time: ${num} min`);
// } else {
//     const hours = Math.floor(num / 60);
//     let min = num - (hours * 60);
//     if (min < 10) {
//         min = String(min).padStart(2, "0");
//     }

//     console.log(`Time: ${hours}:${min}`);

// }

//! ----------------------------------

// function foo1(i) {
//     console.log(i);
//     foo1(i + 1);
// };
// foo1(1)


//! ----------------------------------

// Завдання 5:

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"


// let login = prompt('login');
// let password;
// console.log(login);
// if (login === 'Адмін') {
//     password = prompt('password');
// if (password === 'Я головний') {
//     alert('Добрий день!');
// } else {
//     alert('Невірний пароль!')
// }
// } else if (login === '' || login === null) {
//     alert('Скасовано');
// } else {
//     alert('Я вас не знаю');
// }


//! ----------------------------------

